first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE "artwork_shares"."user_id" = $1  [["user_id", "1"]]
---
    def index
        if params.has_key?(:user_id)
            #arts.com/users/4/artworks
            @artworks = Artwork
                .where(artist_id: params[:user_id])

            @artworks_shared = Artwork
                .joins(:shares)
                .where(artwork_shares: {user_id: params[:user_id]})

            render json: (@artworks + @artworks_shared).uniq
        else
            @artworks = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @artwork = Artwork.find(params["id"])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "name" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["name", "Le Couvant de Mona"], ["updated_at", "2020-04-23 14:29:48.142619"], ["id", 2]]
---
    def update
        @artwork = Artwork.find(params["id"])

        if @artwork.update(artwork_params)

INSERT INTO "artworks" ("name", "artist_id", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mia en La Badae"], ["artist_id", 2], ["image_url", "https://i.imgur.com/GEO5mna.jpg"], ["created_at", "2020-04-23 14:48:16.793325"], ["updated_at", "2020-04-23 14:48:16.793325"]]
---
    def create
        @artwork = Artwork.new(artwork_params)

        if @artwork.save