first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save
---
INSERT INTO "artwork_shares" ("user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["artwork_id", 2], ["created_at", "2020-04-23 15:11:12.654215"], ["updated_at", "2020-04-23 15:11:12.654215"]]

    def destroy
        @artwork_share = ArtworkShare.find(params["id"])
        @artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 7]]