first_routes_and_controllers/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]
---
    def index
        if params.has_key?(:user_id)
            @comments = Comment.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
            @comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["artwork_id", 2], ["body", "You're a ducker"], ["created_at", "2020-04-23 18:16:23.064014"], ["updated_at", "2020-04-23 18:16:23.064014"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.artwork_id = params[:artwork_id])

        if @comment.save