first_routes_and_controllers/app/controllers/likes_controller.rb

    def index
        if params[:user_id]
            @likes = Like.where(user_id: params[:user_id])
        elsif params[:artwork_id]
            @likes = Like.where(likeable_id: params[:artwork_id])
        elsif params[:comment_id]
            @likes = Like.where(likeable_id: params[:comment_id])
        else
            @likes = Like.all
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1  [["likeable_id", 1]]
SELECT "likes".* FROM "likes"

    def create
        @like = Like.new(like_params)
        if @like.save
---
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["likeable_type", "Comment"], ["likeable_id", 3], ["created_at", "2020-04-23 21:18:38.820963"], ["updated_at", "2020-04-23 21:18:38.820963"]]

    def destroy
        @like = Like.find(params[:id])
        @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 11]]