first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Bobathan"]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bobathon"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        @users = User.where(username: params[:username])

        if @users.empty?

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: User.find(params["id"])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "poptart"], ["email", "toasterstrudel@bread.me"], ["updated_at", "2020-04-22 20:13:18.890315"], ["id", 2]]
---
    def update
        @user = User.find(params["id"])
        if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
        @user = User.find(params["id"])
        @user.destroy